#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

terraform
null_resource.lambda-copy: Refreshing state... [id=1973252705955148162]
null_resource.py-deps: Refreshing state... [id=4398869244593134656]
data.aws_caller_identity.current: Reading...
aws_dynamodb_table.vehicle_dynamodb_table: Refreshing state... [id=vehicle]
aws_dynamodb_table.airport_dynamodb_table: Refreshing state... [id=airport]
aws_iam_role.iam-for-lambda: Refreshing state... [id=iam-for-lambda]
aws_api_gateway_api_key.holiday-key: Refreshing state... [id=lmqy8vr105]
data.aws_caller_identity.current: Read complete after 0s [id=372275380789]
aws_iam_policy.dynamodb-lambda-policy: Refreshing state... [id=arn:aws:iam::372275380789:policy/dynamodb-lambda-policy]
aws_iam_policy_attachment.dynamodb-lambda-attach: Refreshing state... [id=dynamodb-lambda-attachment]
aws_lambda_function.lambda: Refreshing state... [id=holiday-lambda-function]
aws_iam_role_policy.apigw-cloudwatch-policy: Refreshing state... [id=iam-for-lambda:apigw-cloudwatch-policy]
aws_api_gateway_account.api_gateway_account: Refreshing state... [id=api-gateway-account]
data.template_file.open-api-specification: Reading...
data.template_file.open-api-specification: Read complete after 0s [id=31e2666a164e46cbfb8b61a0b3c691af4d3603b3ac306a40a0099551bb31e3cf]
aws_api_gateway_rest_api.holiday-api: Refreshing state... [id=8v5w5mv4ze]
aws_api_gateway_deployment.holiday-deploy: Refreshing state... [id=mhljx4]
aws_lambda_permission.api-gateway-invoke-lambda: Refreshing state... [id=AllowAPIGatewayInvoke]
aws_cloudwatch_log_group.api-gw-logs: Refreshing state... [id=api-gw-logs_8v5w5mv4ze/holiday-stage]
aws_api_gateway_stage.holiday-stage: Refreshing state... [id=ags-8v5w5mv4ze-holiday-stage]
aws_api_gateway_usage_plan.DevUsagePlan: Refreshing state... [id=jpwduw]
aws_api_gateway_method_settings.all: Refreshing state... [id=8v5w5mv4ze-holiday-stage-*/*]
aws_api_gateway_usage_plan_key.devUsageKey: Refreshing state... [id=lmqy8vr105]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  ~ update in-place
+/- create replacement and then destroy
 <= read (data resources)

Terraform will perform the following actions:

  # data.archive_file.lambda-zip will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "archive_file" "lambda-zip" {
      + id                  = (known after apply)
      + output_base64sha256 = (known after apply)
      + output_md5          = (known after apply)
      + output_path         = "lambda.zip"
      + output_sha          = (known after apply)
      + output_size         = (known after apply)
      + source_dir          = "./lambda"
      + type                = "zip"
    }

  # aws_api_gateway_stage.holiday-stage will be updated in-place
  ~ resource "aws_api_gateway_stage" "holiday-stage" {
      ~ deployment_id         = "nezu22" -> "mhljx4"
        id                    = "ags-8v5w5mv4ze-holiday-stage"
        tags                  = {}
        # (9 unchanged attributes hidden)
    }

  # null_resource.lambda-copy must be replaced
+/- resource "null_resource" "lambda-copy" {
      ~ id       = "1973252705955148162" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "always_run" = "2023-01-03T20:29:50Z" -> (known after apply)
        }
    }

  # null_resource.py-deps must be replaced
+/- resource "null_resource" "py-deps" {
      ~ id       = "4398869244593134656" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "always_run" = "2023-01-03T20:29:50Z" -> (known after apply)
        }
    }

Plan: 2 to add, 1 to change, 2 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>
*Pushed by: @radhixcode, Action: `pull_request`*